# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault_certificate.vpn will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_certificate" "vpn" {
      + certificate_data                = (known after apply)
      + certificate_data_base64         = (known after apply)
      + certificate_policy              = (known after apply)
      + expires                         = (known after apply)
      + id                              = (known after apply)
      + key_vault_id                    = (known after apply)
      + name                            = "VPNRootCert"
      + not_before                      = (known after apply)
      + resource_manager_id             = (known after apply)
      + resource_manager_versionless_id = (known after apply)
      + secret_id                       = (known after apply)
      + tags                            = (known after apply)
      + thumbprint                      = (known after apply)
      + version                         = (known after apply)
      + versionless_id                  = (known after apply)
      + versionless_secret_id           = (known after apply)
    }

  # azuread_application.vpn will be created
  + resource "azuread_application" "vpn" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "Product: Authorization VPN"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "a9585a64-20f0-4d18-aba6-9930f92b809c",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + api {
          + requested_access_token_version = 2

          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access the VPN API on behalf of the signed-in user."
              + admin_consent_display_name = "Access VPN API"
              + enabled                    = true
              + id                         = "101e9ced-01bc-7b00-3640-7e8d1f57ed73"
              + type                       = "Admin"
              + value                      = "VPN.Access"
            }
        }
    }

  # azuread_application_identifier_uri.vpn will be created
  + resource "azuread_application_identifier_uri" "vpn" {
      + application_id = (known after apply)
      + id             = (known after apply)
      + identifier_uri = (known after apply)
    }

  # azuread_application_pre_authorized.vpn will be created
  + resource "azuread_application_pre_authorized" "vpn" {
      + application_id       = (known after apply)
      + authorized_client_id = "c632b3df-fb67-4d84-bdcf-b95ad541b5c8"
      + id                   = (known after apply)
      + permission_ids       = [
          + "101e9ced-01bc-7b00-3640-7e8d1f57ed73",
        ]
    }

  # azuread_service_principal.vpn will be created
  + resource "azuread_service_principal" "vpn" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)
    }

  # azurerm_firewall.firewall will be created
  + resource "azurerm_firewall" "firewall" {
      + dns_proxy_enabled   = (known after apply)
      + firewall_policy_id  = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "fwaltinnauth001hub"
      + resource_group_name = "rgaltinnauth001hub"
      + sku_name            = "AZFW_VNet"
      + sku_tier            = "Standard"
      + tags                = {
          + "CreatedAt"   = "2025-01-10T15:03:03Z"
          + "Environment" = "hub"
          + "Instance"    = "001"
          + "ProductName" = "auth"
        }
      + threat_intel_mode   = (known after apply)

      + ip_configuration {
          + name                 = "FrontendIPv4PublicIP"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/publicIPAddresses/pipfwipv4altinnauth001hub"
          + subnet_id            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub/subnets/AzureFirewallSubnet"
        }

      + management_ip_configuration {
          + name                 = "ManagementIPv4PublicIP"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/publicIPAddresses/pipfwmgmtipv4altinnauth001hub"
          + subnet_id            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub/subnets/AzureFirewallManagementSubnet"
        }
    }

  # azurerm_firewall_policy.firewall will be created
  + resource "azurerm_firewall_policy" "firewall" {
      + child_policies           = (known after apply)
      + firewalls                = (known after apply)
      + id                       = (known after apply)
      + location                 = "norwayeast"
      + name                     = "fwpolicyaltinnauth001hub"
      + resource_group_name      = "rgaltinnauth001hub"
      + rule_collection_groups   = (known after apply)
      + sku                      = "Standard"
      + tags                     = {
          + "CreatedAt"   = "2025-01-10T15:03:03Z"
          + "Environment" = "hub"
          + "Instance"    = "001"
          + "ProductName" = "auth"
        }
      + threat_intelligence_mode = "Alert"
    }

  # azurerm_key_vault.key_vault will be created
  + resource "azurerm_key_vault" "key_vault" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "kvaltinnauth001hub"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "rgaltinnauth001hub"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "CreatedAt"   = "2025-01-10T15:03:03Z"
          + "Environment" = "hub"
          + "Instance"    = "001"
          + "ProductName" = "auth"
        }
      + tenant_id                     = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
      + vault_uri                     = (known after apply)
    }

  # azurerm_key_vault_certificate.vpn will be created
  + resource "azurerm_key_vault_certificate" "vpn" {
      + certificate_attribute           = (known after apply)
      + certificate_data                = (known after apply)
      + certificate_data_base64         = (known after apply)
      + id                              = (known after apply)
      + key_vault_id                    = (known after apply)
      + name                            = "VPNRootCert"
      + resource_manager_id             = (known after apply)
      + resource_manager_versionless_id = (known after apply)
      + secret_id                       = (known after apply)
      + thumbprint                      = (known after apply)
      + version                         = (known after apply)
      + versionless_id                  = (known after apply)
      + versionless_secret_id           = (known after apply)

      + certificate {
          + contents = (sensitive value)
        }
    }

  # azurerm_private_dns_resolver.resolver will be updated in-place
  ~ resource "azurerm_private_dns_resolver" "resolver" {
        id                  = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/dnsResolvers/dnsresaltinnauth001hub"
        name                = "dnsresaltinnauth001hub"
      ~ tags                = {
          ~ "CreatedAt"   = "1/10/2025 3:03:03 PM" -> "2025-01-10T15:03:03Z"
            "Environment" = "hub"
            "Instance"    = "001"
            "ProductName" = "auth"
        }
        # (3 unchanged attributes hidden)
    }

  # azurerm_private_endpoint.key_vault will be created
  + resource "azurerm_private_endpoint" "key_vault" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "nickvaltinnauth001hub"
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "pepkvaltinnauth001hub"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "rgaltinnauth001hub"
      + subnet_id                     = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub/subnets/Default"
      + tags                          = {
          + "CreatedAt"   = "2025-01-10T15:03:03Z"
          + "Environment" = "hub"
          + "Instance"    = "001"
          + "ProductName" = "auth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "key-vault"
          + private_dns_zone_ids = [
              + "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "key-vault"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # azurerm_role_assignment.key_vault_administrator will be created
  + resource "azurerm_role_assignment" "key_vault_administrator" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a9585a64-20f0-4d18-aba6-9930f92b809c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_route_table.vpn will be created
  + resource "azurerm_route_table" "vpn" {
      + bgp_route_propagation_enabled = true
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "rtvpnaltinnauth001hub"
      + resource_group_name           = "rgaltinnauth001hub"
      + route                         = [
          + {
              + address_prefix         = "0.0.0.0/1"
              + name                   = "IPv4ForcedTunneling1"
              + next_hop_in_ip_address = (known after apply)
              + next_hop_type          = "VirtualAppliance"
            },
          + {
              + address_prefix         = "128.0.0.0/1"
              + name                   = "IPv4ForcedTunneling2"
              + next_hop_in_ip_address = (known after apply)
              + next_hop_type          = "VirtualAppliance"
            },
        ]
      + subnets                       = (known after apply)
    }

  # azurerm_subnet_route_table_association.vpn will be created
  + resource "azurerm_subnet_route_table_association" "vpn" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub/subnets/GatewaySubnet"
    }

  # azurerm_virtual_network_gateway.vpn will be created
  + resource "azurerm_virtual_network_gateway" "vpn" {
      + active_active                         = false
      + bgp_route_translation_for_nat_enabled = false
      + dns_forwarding_enabled                = false
      + enable_bgp                            = false
      + generation                            = (known after apply)
      + id                                    = (known after apply)
      + ip_sec_replay_protection_enabled      = true
      + location                              = "norwayeast"
      + name                                  = "vpnaltinnauth001hub"
      + private_ip_address_enabled            = false
      + remote_vnet_traffic_enabled           = false
      + resource_group_name                   = "rgaltinnauth001hub"
      + sku                                   = "VpnGw1"
      + type                                  = "Vpn"
      + virtual_wan_traffic_enabled           = false
      + vpn_type                              = "RouteBased"

      + ip_configuration {
          + name                          = "ip-config"
          + private_ip_address_allocation = "Dynamic"
          + public_ip_address_id          = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/publicIPAddresses/pipvpnaltinnauth001hub"
          + subnet_id                     = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub/subnets/GatewaySubnet"
        }

      + vpn_client_configuration {
          + aad_audience         = (known after apply)
          + aad_issuer           = "https://sts.windows.net/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/"
          + aad_tenant           = "https://login.microsoftonline.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
          + address_space        = [
              + "192.168.20.0/24",
            ]
          + vpn_auth_types       = [
              + "AAD",
              + "Certificate",
            ]
          + vpn_client_protocols = [
              + "OpenVPN",
            ]

          + root_certificate {
              + name             = "VPNRootCert"
              + public_cert_data = (known after apply)
            }
        }
    }

Plan: 13 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `push` |
| Working Directory | `infra/deploy/hub` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/prod/hub.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_prod_hub.tfstate.tfplan`